app/Views/frontend/index.php

                                        <div class="post-gallery">
                                            <?php
                                            $galeriKegiatanFotoModel = new GaleriKegiatanFotoModel();
                                            $galeri_kegiatan_foto = $galeriKegiatanFotoModel
                                                ->where('galeri_kegiatan_id', $d->galeri_kegiatan_id)
                                                ->first();
---
SELECT *
FROM `galeri_kegiatan_foto`
WHERE `galeri_kegiatan_id` = '2'
AND `galeri_kegiatan_foto`.`deleted_at` IS NULL
 LIMIT 1


                                        $this->kontakModel = new KontakModel();
                                        foreach ($kontak as $d) :
                                            $balas = $this->kontakModel
                                                ->where('kontak_id_parent', $d->kontak_id)
                                                ->first(); ?>
---
SELECT *
FROM `kontak`
WHERE `kontak_id_parent` = '4'
AND `kontak`.`deleted_at` IS NULL
 LIMIT 1