app/Views/frontend/kontak.php


                                $this->kontakModel = new KontakModel();
                                foreach ($konten as $d) :
                                    $balas = $this->kontakModel
                                        ->where('kontak_id_parent', $d->kontak_id)
                                        ->first(); ?>
---
SELECT *
FROM `kontak`
WHERE `kontak_id_parent` = '4'
AND `kontak`.`deleted_at` IS NULL
 LIMIT 1