app/Views/frontend/kontakcari.php

SELECT *
FROM `kontak`
WHERE `kontak_id_parent` = '4'
AND `kontak`.`deleted_at` IS NULL
 LIMIT 1
---

                                    $this->kontakModel = new KontakModel();
                                    foreach ($konten as $d) :
                                        $balas = $this->kontakModel
                                            ->where('kontak_id_parent', $d->kontak_id)
                                            ->first(); ?>