app/Views/frontend/pidato_pantun.php

                                $this->pidatoPantunModel = new PidatoPantunModel();
                                $no = 1;
                                foreach ($konten as $d) :
                                    $data = $this->pidatoPantunModel
                                        ->join('pidato_detail', 'pidato_pantun.pidato_detail_id = pidato_detail.pidato_detail_id')
                                        ->where('pidato_pantun.pidato_detail_id', $d->pidato_detail_id)
                                        ->orderby('pidato_pantun.pidato_pantun_id', 'desc')
                                        ->findAll(); ?>
---
SELECT *
FROM `pidato_pantun`
JOIN `pidato_detail` ON `pidato_pantun`.`pidato_detail_id` = `pidato_detail`.`pidato_detail_id`
WHERE `pidato_pantun`.`pidato_detail_id` = '4'
AND `pidato_pantun`.`deleted_at` IS NULL
ORDER BY `pidato_pantun`.`pidato_pantun_id` DESC