app/Validation/UserRules.php

	public function checkLogin(string $str, string $fields, array $data) {
		$model = new User();
		$user = $model->where('users_name', $data['username'])->find();
		if (!$user || count($user) > 1) {
			return false;
		}

		$result = password_verify(
			$data['password'] . $user[0]->users_salt,
			$user[0]->users_password
		);
		if ($result) {
			$request = \Config\Services::request();
			$model->save([
				'users_id' => $user[0]->users_id,
				'users_lastip' => $request->getIPAddress(),
				'users_lastlogin' => Time::now(),
			]);
---
UPDATE `users` SET `users_lastip` = '::1', `users_lastlogin` = '2023-08-07 07:00:31', `users_updated` = '2023-08-07 07:00:31'
WHERE `users`.`users_id` IN ('1')