app/Controllers/Nimda/Home.php

    public function index()
    {
        $data['title'] = 'Dashboard';

        $data['users'] = $this->userModel->find(session()->userid);
        $data['pengaturan'] = $this->pengaturanModel->first();
        $data['jmlberita'] = $this->beritadetailModel->selectCount('berita_detail_id')->first();
        $data['jmlpidato'] = $this->pidatodetailModel->selectCount('pidato_detail_id')->first();
        $data['jmlagenda'] = $this->agendaModel->selectCount('agenda_id')->first();
        $data['jmlslider'] = $this->sliderModel->selectCount('slider_id')->first();
        $data['berita'] = $this->beritadetailModel
            ->join('berita', 'berita_detail.berita_id = berita.berita_id')
            ->orderby('berita_detail.berita_detail_id', 'desc')
            ->limit(5)
            ->findAll();
        $data['agenda'] = $this->agendaModel
            ->orderby('agenda_id', 'desc')
            ->limit(5)
            ->findAll();

        //grafik user
        $db = \Config\Database::connect();
        $query = $db->query('SELECT COUNT(pengunjung_tgl)as jml, pengunjung_tgl FROM pengunjung WHERE year(pengunjung_tgl) = 2021 GROUP BY month(pengunjung_tgl)');
        $results = $query->getResult();
        $data['pengunjung'] = $results;

        $jmlos = $this->PengunjungModel->countAllResults();
---
SELECT *
FROM `pengaturan`
WHERE `pengaturan`.`deleted_at` IS NULL
 LIMIT 1
SELECT COUNT(`berita_detail_id`) AS `berita_detail_id`
FROM `berita_detail`
WHERE `berita_detail`.`deleted_at` IS NULL
 LIMIT 1
SELECT COUNT(`pidato_detail_id`) AS `pidato_detail_id`
FROM `pidato_detail`
WHERE `pidato_detail`.`deleted_at` IS NULL
 LIMIT 1
SELECT COUNT(`agenda_id`) AS `agenda_id`
FROM `agenda`
WHERE `agenda`.`deleted_at` IS NULL
 LIMIT 1
SELECT COUNT(`slider_id`) AS `slider_id`
FROM `slider`
WHERE `slider`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `berita_detail`
JOIN `berita` ON `berita_detail`.`berita_id` = `berita`.`berita_id`
WHERE `berita_detail`.`deleted_at` IS NULL
ORDER BY `berita_detail`.`berita_detail_id` DESC
SELECT *
FROM `agenda`
WHERE `agenda`.`deleted_at` IS NULL
ORDER BY `agenda_id` DESC
SELECT COUNT(*) AS `numrows`
FROM `pengunjung`
WHERE `pengunjung`.`deleted_at` IS NULL

        $data['browser'] = $resultsb;

        //statistik OS
        $w10 = $this->PengunjungModel->selectCount('pengunjung_os')->where('pengunjung_os', 'Windows 10')->countAllResults();
        $data['w10'] = ceil(($w10 / $jmlos) * 100);
        $w8 = $this->PengunjungModel->selectCount('pengunjung_os')->where('pengunjung_os', 'Windows 8')->countAllResults();
        $data['w8'] = ceil(($w8 / $jmlos) * 100);
        $mac = $this->PengunjungModel->selectCount('pengunjung_os')->where('pengunjung_os', 'Mac OS')->countAllResults();
        $data['mac'] = ceil(($mac / $jmlos) * 100);
        $android = $this->PengunjungModel->selectCount('pengunjung_os')->where('pengunjung_os', 'Android')->countAllResults();
        $data['android'] = ceil(($android / $jmlos) * 100);
        $other = $this->PengunjungModel->selectCount('pengunjung_os')->where('pengunjung_os', 'Other')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pengunjung`
WHERE `pengunjung_os` = 'Windows 10'
AND `pengunjung`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `pengunjung`
WHERE `pengunjung_os` = 'Windows 8'
AND `pengunjung`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `pengunjung`
WHERE `pengunjung_os` = 'Mac OS'
AND `pengunjung`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `pengunjung`
WHERE `pengunjung_os` = 'Android'
AND `pengunjung`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `pengunjung`
WHERE `pengunjung_os` = 'Other'
AND `pengunjung`.`deleted_at` IS NULL