app/Controllers/Nimda/Pengaturan.php

    public function index()
    {
        $data['title'] = 'Pengaturan';

        $data['users'] = $this->userModel->find(session()->userid);
        $data['pengaturan'] = $this->pengaturanModel->first();
---
SELECT *
FROM `pengaturan`
WHERE `pengaturan`.`deleted_at` IS NULL
 LIMIT 1

        //end Banner
        //dd($namaSampul);

        $r = $this->pengaturanModel->save([
            'pengaturan_id' => $id,

            'pengaturan_alamat' => $this->request->getPost('pengaturan_alamat'),
            'pengaturan_telp' => $this->request->getPost('pengaturan_telp'),
            'pengaturan_fax' => $this->request->getPost('pengaturan_fax'),
            'pengaturan_email' => $this->request->getPost('pengaturan_email'),
            'pengaturan_facebook' => $this->request->getPost('pengaturan_facebook'),
            'pengaturan_twitter' => $this->request->getPost('pengaturan_twitter'),
            'pengaturan_instagram' => $this->request->getPost('pengaturan_instagram'),
            'pengaturan_youtube' => $this->request->getPost('pengaturan_youtube'),
            'pengaturan_footer' => $this->request->getPost('pengaturan_footer'),
            'pengaturan_logo_header' => $namaSampulHeader,
            'pengaturan_favicon' => $namaSampulFavicon,
            'pengaturan_banner' => $namaSampulBanner,
        ]);
---
UPDATE `pengaturan` SET `pengaturan_alamat` = 'treter43', `pengaturan_telp` = '0865113', `pengaturan_fax` = '0865113', `pengaturan_email` = 'wdwd@fdfd.df', `pengaturan_facebook` = '', `pengaturan_twitter` = 'yyy', `pengaturan_instagram` = 'yyy', `pengaturan_youtube` = '', `pengaturan_footer` = 'Copyright © 2023 Prokopim Pemerintah Kabupaten Berau', `pengaturan_logo_header` = '1691232108_470de532c7550208535e.png', `pengaturan_favicon` = '1691232108_756b255ca763faa00a0f.png', `pengaturan_banner` = '1692870809_6e0703e104028228e71a.jpg', `updated_at` = '2023-08-27 23:12:21'
WHERE `pengaturan`.`pengaturan_id` IN ('1')