app/Controllers/Nimda/Penghargaan.php

SELECT *
FROM `pengaturan`
WHERE `pengaturan`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `kategori`
WHERE `kategori`.`deleted_at` IS NULL
ORDER BY `kategori_judul` ASC
---
    public function add()
    {
        $data['title'] = 'Tambah Penghargaan';

        $data['users'] = $this->userModel->find(session()->userid);
        $data['pengaturan'] = $this->pengaturanModel->first();

        $def = new Definisi();
        $data['kategori'] = $this->ketegoriModel->orderby('kategori_judul', 'asc')->findAll();

SELECT *
FROM `pengaturan`
WHERE `pengaturan`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `kategori`
WHERE `kategori`.`deleted_at` IS NULL
ORDER BY `kategori_judul` ASC
SELECT *
FROM `penghargaan`
WHERE `penghargaan`.`deleted_at` IS NULL
AND `penghargaan`.`penghargaan_id` = '5'
---
    public function edit($id)
    {
        $data['title'] = 'Edit Pidato';

        $data['users'] = $this->userModel->find(session()->userid);
        $data['pengaturan'] = $this->pengaturanModel->first();

        $def = new Definisi();
        $data['kategori'] = $this->ketegoriModel->orderby('kategori_judul', 'asc')->findAll();
        $data['penghargaan'] = $this->penghargaanModel->find($id);