app/Controllers/Auth.php

	public function index()
	{
		if (session()->isLoggedIn) {
			return redirect()->to('/nimda');
		}
		$data['data'] = '';
		$data['pengaturan'] = $this->pengaturanModel->first();
---
SELECT *
FROM `pengaturan`
WHERE `pengaturan`.`deleted_at` IS NULL
 LIMIT 1