app/Controllers/BaseController.php

SELECT COUNT(*) AS `numrows`
FROM `pengunjung`
WHERE `pengunjung_ip` = '::1'
AND `pengunjung_tgl` = '2023-09-05'
AND `pengunjung`.`deleted_at` IS NULL
---
	public function initController(\CodeIgniter\HTTP\RequestInterface $request, \CodeIgniter\HTTP\ResponseInterface $response, \Psr\Log\LoggerInterface $logger)
	{
		// Do Not Edit This Line
		parent::initController($request, $response, $logger);
		helper('myhelper');

		//--------------------------------------------------------------------
		// Preload any models, libraries, etc, here.
		//--------------------------------------------------------------------
		// E.g.:
		$this->session = \Config\Services::session();

		$this->PengunjungModel = new PengunjungModel();
		$this->UseronlineModel = new UseronlineModel();

		//Pengunjung
		$ip    = $_SERVER['REMOTE_ADDR']; // Mendapatkan IP user
		$tgl  = date("Y-m-d"); // Mendapatkan tanggal sekarang

		// Cek berdasarkan IP, apakah user sudah pernah mengakses hari ini
		$cekip = $this->PengunjungModel->where('pengunjung_ip', $ip)->where('pengunjung_tgl', $tgl)->countAllResults();

INSERT INTO `usersonline` (`usersonline_timestamp`, `usersonline_ip`, `usersonline_file`, `created_at`, `updated_at`) VALUES (1693890276, '::1', '/index.php/home/', '2023-09-05 05:04:36', '2023-09-05 05:04:36')
UPDATE `usersonline` SET `deleted_at` = '2023-09-05 05:04:36', `updated_at` = '2023-09-05 05:04:36'
WHERE `usersonline_timestamp` < 1693890246
AND `deleted_at` IS NULL
---
		$REMOTEADDR = $_SERVER['REMOTE_ADDR'];
		$PHPSELF = $_SERVER['PHP_SELF'];

		$this->UseronlineModel->save([
			'usersonline_timestamp' => $t_stamp,
			'usersonline_ip' => $REMOTEADDR,
			'usersonline_file' => $PHPSELF,
		]);

		$this->UseronlineModel->where('usersonline_timestamp <', $timeout)->delete();