app/Controllers/Berita_foto.php

SELECT *
FROM `pengaturan`
WHERE `pengaturan`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `profil`
WHERE `profil`.`deleted_at` IS NULL
ORDER BY `profil_id` ASC
SELECT *
FROM `sekretariat`
WHERE `sekretariat`.`deleted_at` IS NULL
ORDER BY `sekretariat_id` ASC
SELECT *
FROM `berita`
WHERE `berita`.`deleted_at` IS NULL
ORDER BY `berita_id` ASC
SELECT *
FROM `kategori`
WHERE `kategori`.`deleted_at` IS NULL
ORDER BY `kategori_id` ASC
SELECT *
FROM `download`
WHERE `download`.`deleted_at` IS NULL
ORDER BY `download_id` ASC
SELECT COUNT(*) AS `numrows` FROM `berita_detail`
SELECT COUNT(*) AS `numrows` FROM `galeri_kegiatan_foto`
SELECT COUNT(*) AS `numrows` FROM `berita_foto`
SELECT COUNT(*) AS `numrows` FROM `video_kegiatan`
SELECT COUNT(*) AS `numrows` FROM `pidato_pantun`
SELECT COUNT(*) AS `numrows` FROM `galeri_kegiatan`
SELECT *
FROM `berita_detail`
JOIN `berita` ON `berita`.`berita_id` = `berita_detail`.`berita_id`
WHERE `berita_detail`.`deleted_at` IS NULL
ORDER BY `berita_detail`.`berita_detail_id` DESC
 LIMIT 5
SELECT *
FROM `agenda`
WHERE `agenda`.`deleted_at` IS NULL
ORDER BY `agenda_id` DESC
 LIMIT 5
SELECT *
FROM `download_detail`
JOIN `download` ON `download`.`download_id` = `download_detail`.`download_id`
WHERE `download_detail`.`deleted_at` IS NULL
ORDER BY `download_detail`.`download_detail_id` DESC
 LIMIT 5
SELECT *
FROM `berita_detail`
JOIN `berita` ON `berita`.`berita_id` = `berita_detail`.`berita_id`
WHERE `berita_detail`.`deleted_at` IS NULL
ORDER BY `berita_detail`.`berita_detail_dibaca` DESC
 LIMIT 5
SELECT *
FROM `berita_foto`
WHERE `berita_foto`.`deleted_at` IS NULL
ORDER BY `berita_foto_id` DESC
 LIMIT 9
SELECT COUNT(*) AS `numrows`
FROM `berita_foto`
WHERE `berita_foto`.`deleted_at` IS NULL
---
    public function index()
    {
        $data['title'] = '| Berita Foto';
        $data['menu'] = 'kedua';
        $data['pengaturan'] = $this->pengaturanModel
            ->first();

        //Menu
        $data['profil'] = $this->profilModel
            ->orderby('profil_id', 'asc')
            ->findAll();
        $data['sekretariat'] = $this->sekretariatModel
            ->orderby('sekretariat_id', 'asc')
            ->findAll();
        $data['berita'] = $this->beritaModel
            ->orderby('berita_id', 'asc')
            ->findAll();
        $data['kategori'] = $this->kategoriModel
            ->orderby('kategori_id', 'asc')
            ->findAll();
        $data['download_menu'] = $this->downloadModel
            ->orderby('download_id', 'asc')
            ->findAll();

        //side
        $data['jml_berita'] = $this->beritadetailModel->countAll();
		$data['jml_galeri_foto'] = $this->galeriKegiatanFotoModel->countAll();
		$data['jml_berita_foto'] = $this->beritaFotoModel->countAll();
		$data['jml_video_kegiatan'] = $this->videoKegiatanModel->countAll();
        $data['jml_pidato_pantun'] = $this->pidatoPantunModel->countAll();
		$data['jml_galeri_kegiatan'] = $this->galeriKegiatanModel->countAll();
        $data['berita_baru'] = $this->beritadetailModel
            ->join('berita', 'berita.berita_id = berita_detail.berita_id')
            ->orderby('berita_detail.berita_detail_id', 'desc')
            ->limit(5)->findAll();
        $data['agenda_baru'] = $this->agendaModel
            ->orderby('agenda_id', 'desc')
            ->limit(5)->findAll();
        $data['download'] = $this->downloadDetailModel
            ->join('download', 'download.download_id = download_detail.download_id')
            ->orderby('download_detail.download_detail_id', 'desc')
            ->limit(5)->findAll();

        $data['berita_populer'] = $this->beritadetailModel
            ->join('berita', 'berita.berita_id = berita_detail.berita_id')
            ->orderby('berita_detail.berita_detail_dibaca', 'desc')
            ->limit(5)->findAll();

        //Content
        $data['konten'] = $this->beritaFotoModel
            ->orderby('berita_foto_id', 'desc')
            ->paginate(9, 'hal');

SELECT *
FROM `pengaturan`
WHERE `pengaturan`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `profil`
WHERE `profil`.`deleted_at` IS NULL
ORDER BY `profil_id` ASC
SELECT *
FROM `sekretariat`
WHERE `sekretariat`.`deleted_at` IS NULL
ORDER BY `sekretariat_id` ASC
SELECT *
FROM `berita`
WHERE `berita`.`deleted_at` IS NULL
ORDER BY `berita_id` ASC
SELECT *
FROM `kategori`
WHERE `kategori`.`deleted_at` IS NULL
ORDER BY `kategori_id` ASC
SELECT *
FROM `download`
WHERE `download`.`deleted_at` IS NULL
ORDER BY `download_id` ASC
SELECT COUNT(*) AS `numrows` FROM `berita_detail`
SELECT COUNT(*) AS `numrows` FROM `galeri_kegiatan_foto`
SELECT COUNT(*) AS `numrows` FROM `berita_foto`
SELECT COUNT(*) AS `numrows` FROM `video_kegiatan`
SELECT COUNT(*) AS `numrows` FROM `pidato_pantun`
SELECT COUNT(*) AS `numrows` FROM `galeri_kegiatan`
SELECT *
FROM `berita_detail`
JOIN `berita` ON `berita`.`berita_id` = `berita_detail`.`berita_id`
WHERE `berita_detail`.`deleted_at` IS NULL
ORDER BY `berita_detail`.`berita_detail_id` DESC
 LIMIT 5
SELECT *
FROM `agenda`
WHERE `agenda`.`deleted_at` IS NULL
ORDER BY `agenda_id` DESC
 LIMIT 5
SELECT *
FROM `download_detail`
JOIN `download` ON `download`.`download_id` = `download_detail`.`download_id`
WHERE `download_detail`.`deleted_at` IS NULL
ORDER BY `download_detail`.`download_detail_id` DESC
 LIMIT 5
SELECT *
FROM `berita_detail`
JOIN `berita` ON `berita`.`berita_id` = `berita_detail`.`berita_id`
WHERE `berita_detail`.`deleted_at` IS NULL
ORDER BY `berita_detail`.`berita_detail_dibaca` DESC
 LIMIT 5
SELECT *
FROM `berita_foto`
WHERE `berita_foto_slug` = 'bupati-bengkalis-saat-menyerahkan-1179-sertifikat-tanah-kepada-masyarakat'
AND `berita_foto`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `berita_foto`
WHERE `berita_foto`.`deleted_at` IS NULL
ORDER BY rand()
 LIMIT 6
---
    public function detail($slugKonten)
    {
        $data['title'] = '| Detail Berita Foto';
        $data['menu'] = 'kedua';
        $data['pengaturan'] = $this->pengaturanModel
            ->first();

        //Menu
        $data['profil'] = $this->profilModel
            ->orderby('profil_id', 'asc')
            ->findAll();
        $data['sekretariat'] = $this->sekretariatModel
            ->orderby('sekretariat_id', 'asc')
            ->findAll();
        $data['berita'] = $this->beritaModel
            ->orderby('berita_id', 'asc')
            ->findAll();
        $data['kategori'] = $this->kategoriModel
            ->orderby('kategori_id', 'asc')
            ->findAll();
        $data['download_menu'] = $this->downloadModel
            ->orderby('download_id', 'asc')
            ->findAll();

        //side
        $data['jml_berita'] = $this->beritadetailModel->countAll();
		$data['jml_galeri_foto'] = $this->galeriKegiatanFotoModel->countAll();
		$data['jml_berita_foto'] = $this->beritaFotoModel->countAll();
		$data['jml_video_kegiatan'] = $this->videoKegiatanModel->countAll();
        $data['jml_pidato_pantun'] = $this->pidatoPantunModel->countAll();
		$data['jml_galeri_kegiatan'] = $this->galeriKegiatanModel->countAll();
        $data['berita_baru'] = $this->beritadetailModel
            ->join('berita', 'berita.berita_id = berita_detail.berita_id')
            ->orderby('berita_detail.berita_detail_id', 'desc')
            ->limit(5)->findAll();
        $data['agenda_baru'] = $this->agendaModel
            ->orderby('agenda_id', 'desc')
            ->limit(5)->findAll();
        $data['download'] = $this->downloadDetailModel
            ->join('download', 'download.download_id = download_detail.download_id')
            ->orderby('download_detail.download_detail_id', 'desc')
            ->limit(5)->findAll();

        $data['berita_populer'] = $this->beritadetailModel
            ->join('berita', 'berita.berita_id = berita_detail.berita_id')
            ->orderby('berita_detail.berita_detail_dibaca', 'desc')
            ->limit(5)->findAll();

        $data['konten'] = $this->beritaFotoModel
            ->where('berita_foto_slug', $slugKonten)
            ->first();
        $data['lainya'] = $this->beritaFotoModel
            ->orderby('rand()')
            ->limit(6)->findAll();