app/Controllers/Berita.php

SELECT *
FROM `agenda`
WHERE `agenda`.`deleted_at` IS NULL
ORDER BY `agenda_id` DESC
SELECT *
FROM `berita_detail`
JOIN `berita` ON `berita`.`berita_id` = `berita_detail`.`berita_id`
WHERE `berita_detail`.`deleted_at` IS NULL
ORDER BY `berita_detail`.`berita_detail_dibaca` DESC
SELECT *
FROM `berita`
WHERE `berita_slug` = 'kesehatan'
AND `berita`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `berita_detail`
WHERE `berita_id` = '1'
AND `berita_detail`.`deleted_at` IS NULL
ORDER BY `berita_detail_id` DESC
 LIMIT 9
---
    public function index($slug)
    {
        $data['title'] = '| Berita';
        $data['menu'] = 'kedua';
        $data['pengaturan'] = $this->pengaturanModel
            ->first();

        //Menu
        $data['profil'] = $this->profilModel
            ->orderby('profil_id', 'asc')
            ->findAll();
        $data['sekretariat'] = $this->sekretariatModel
            ->orderby('sekretariat_id', 'asc')
            ->findAll();
        $data['berita'] = $this->beritaModel
            ->orderby('berita_id', 'asc')
            ->findAll();
        $data['kategori'] = $this->kategoriModel
            ->orderby('kategori_id', 'asc')
            ->findAll();
        $data['download'] = $this->downloadModel
            ->orderby('download_id', 'asc')
            ->findAll();

        //side
        $data['berita_baru'] = $this->beritadetailModel
            ->join('berita', 'berita.berita_id = berita_detail.berita_id')
            ->orderby('berita_detail.berita_detail_id', 'desc')
            ->limit(5)->findAll();
        $data['agenda_baru'] = $this->agendaModel
            ->orderby('agenda_id', 'desc')
            ->limit(5)->findAll();

        $data['berita_populer'] = $this->beritadetailModel
            ->join('berita', 'berita.berita_id = berita_detail.berita_id')
            ->orderby('berita_detail.berita_detail_dibaca', 'desc')
            ->limit(5)->findAll();

        //Content
        $data['slug'] = $this->beritaModel
            ->where('berita_slug', $slug)
            ->first();
        $data['konten'] = $this->beritadetailModel
            ->where('berita_id', $data['slug']->berita_id)
            ->orderby('berita_detail_id', 'desc')
            ->paginate(9, 'hal');