app/Controllers/Home.php

SELECT *
FROM `pengaturan`
WHERE `pengaturan`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `profil`
WHERE `profil`.`deleted_at` IS NULL
ORDER BY `profil_id` ASC
SELECT *
FROM `sekretariat`
WHERE `sekretariat`.`deleted_at` IS NULL
ORDER BY `sekretariat_id` ASC
SELECT *
FROM `berita`
WHERE `berita`.`deleted_at` IS NULL
ORDER BY `berita_id` ASC
SELECT *
FROM `kategori`
WHERE `kategori`.`deleted_at` IS NULL
ORDER BY `kategori_id` ASC
SELECT *
FROM `download`
WHERE `download`.`deleted_at` IS NULL
ORDER BY `download_id` ASC
SELECT *
FROM `slider`
WHERE `slider`.`deleted_at` IS NULL
ORDER BY `slider_id` DESC
SELECT *
FROM `berita_detail`
JOIN `berita` ON `berita`.`berita_id` = `berita_detail`.`berita_id`
WHERE `berita_detail`.`deleted_at` IS NULL
ORDER BY `berita_detail`.`berita_detail_id` DESC
 LIMIT 4
SELECT COUNT(*) AS `numrows` FROM `berita_detail`
SELECT COUNT(*) AS `numrows` FROM `galeri_kegiatan_foto`
SELECT COUNT(*) AS `numrows` FROM `berita_foto`
SELECT COUNT(*) AS `numrows` FROM `video_kegiatan`
SELECT COUNT(*) AS `numrows` FROM `pidato_pantun`
SELECT COUNT(*) AS `numrows` FROM `galeri_kegiatan`
SELECT *
FROM `agenda`
WHERE `agenda`.`deleted_at` IS NULL
ORDER BY `agenda_id` DESC
 LIMIT 5
SELECT *
FROM `berita_detail`
JOIN `berita` ON `berita`.`berita_id` = `berita_detail`.`berita_id`
WHERE `berita_detail`.`deleted_at` IS NULL
ORDER BY `berita_detail`.`berita_detail_dibaca` DESC
 LIMIT 5
SELECT *
FROM `download_detail`
JOIN `download` ON `download`.`download_id` = `download_detail`.`download_id`
WHERE `download_detail`.`deleted_at` IS NULL
ORDER BY `download_detail`.`download_detail_id` DESC
 LIMIT 5
SELECT *
FROM `berita_foto`
WHERE `berita_foto`.`deleted_at` IS NULL
ORDER BY `berita_foto_id` DESC
 LIMIT 5
SELECT *
FROM `kontak`
WHERE `kontak_show` = 1
AND `kontak`.`deleted_at` IS NULL
ORDER BY `kontak_id` DESC
 LIMIT 5
SELECT *
FROM `berita_foto`
WHERE `berita_foto`.`deleted_at` IS NULL
ORDER BY `berita_foto_id` DESC
 LIMIT 4
SELECT *
FROM `video_kegiatan`
WHERE `video_kegiatan`.`deleted_at` IS NULL
ORDER BY `video_kegiatan_id` DESC
 LIMIT 3
SELECT *
FROM `penghargaan`
JOIN `kategori` ON `kategori`.`kategori_id` = `penghargaan`.`kategori_id`
WHERE `penghargaan`.`deleted_at` IS NULL
ORDER BY `penghargaan`.`penghargaan_id` DESC
 LIMIT 5
SELECT *
FROM `galeri_kegiatan`
WHERE `galeri_kegiatan`.`deleted_at` IS NULL
ORDER BY `galeri_kegiatan_id` DESC
 LIMIT 4
---
	public function index()
	{
		// return redirect()->to(site_url('auth/'));

		$data['title'] = '';
		// $data['menu'] = '';
		// Menu
		$data['pengaturan'] = $this->pengaturanModel
			->first();
		$data['profil'] = $this->profilModel
			->orderby('profil_id', 'asc')
			->findAll();
		$data['sekretariat'] = $this->sekretariatModel
			->orderby('sekretariat_id', 'asc')
			->findAll();
		$data['berita'] = $this->beritaModel
			->orderby('berita_id', 'asc')
			->findAll();
		$data['kategori'] = $this->kategoriModel
			->orderby('kategori_id', 'asc')
			->findAll();
		$data['download_menu'] = $this->downloadModel
			->orderby('download_id', 'asc')
			->findAll();

		//Slider
		$data['slider'] = $this->sliderModel
			->orderby('slider_id', 'desc')
			->findAll();
		//top
		$data['berita_atas'] = $this->beritadetailModel
			->join('berita', 'berita.berita_id = berita_detail.berita_id')
			->orderby('berita_detail.berita_detail_id', 'desc')
			->limit(4)->find();

		//side
		$data['jml_berita'] = $this->beritadetailModel->countAll();
		$data['jml_galeri_foto'] = $this->galeriKegiatanFotoModel->countAll();
		$data['jml_berita_foto'] = $this->beritaFotoModel->countAll();
		$data['jml_video_kegiatan'] = $this->videoKegiatanModel->countAll();
		$data['jml_pidato_pantun'] = $this->pidatoPantunModel->countAll();
		$data['jml_galeri_kegiatan'] = $this->galeriKegiatanModel->countAll();
		$data['agenda_baru'] = $this->agendaModel
            ->orderby('agenda_id', 'desc')
            ->limit(5)->find();
		$data['berita_populer'] = $this->beritadetailModel
            ->join('berita', 'berita.berita_id = berita_detail.berita_id')
            ->orderby('berita_detail.berita_detail_dibaca', 'desc')
            ->limit(5)->find();
		$data['download'] = $this->downloadDetailModel
            ->join('download', 'download.download_id = download_detail.download_id')
            ->orderby('download_detail.download_detail_id', 'desc')
            ->limit(5)->find();
		$data['berita_foto_slide'] = $this->beritaFotoModel
            ->orderby('berita_foto_id', 'desc')
            ->limit(5)->find();
		$data['kontak'] = $this->kontakModel
            ->where('kontak_show', 1)
            ->orderby('kontak_id', 'desc')
            ->limit(5)->find();

		//konten
		$data['berita'] = $this->beritadetailModel
			->join('berita', 'berita.berita_id = berita_detail.berita_id')
			->orderby('berita_detail.berita_detail_id', 'desc')
			->limit(4)->find();
		$data['berita_foto'] = $this->beritaFotoModel
			->orderby('berita_foto_id', 'desc')
			->limit(4)->find();
		$data['video_kegiatan'] = $this->videoKegiatanModel
			->orderby('video_kegiatan_id', 'desc')
			->limit(3)->find();
		$data['penghargaan'] = $this->penghargaanModel
			->join('kategori', 'kategori.kategori_id = penghargaan.kategori_id')
			->orderby('penghargaan.penghargaan_id', 'desc')
			->limit(5)->find();
		$data['galeri_kegiatan'] = $this->galeriKegiatanModel
			->orderby('galeri_kegiatan_id', 'desc')
			->limit(4)->find();

SELECT COUNT(*) AS `numrows`
FROM `pengunjung`
WHERE `pengunjung_tgl` LIKE '%2023%' ESCAPE '!'
AND `pengunjung`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `pengunjung`
WHERE `pengunjung_tgl` LIKE '%2023-09%' ESCAPE '!'
AND `pengunjung`.`deleted_at` IS NULL
---
		$blan = date("Y-m");
		$thn = date("Y");
		//Hari ini
		$data['hariini'] = $this->PengunjungModel->where('pengunjung_tgl', $tgl)->countAllResults();
		//Bulan ini
		$data['bulanini'] = $this->PengunjungModel->like('pengunjung_tgl', $blan)->countAllResults();
		//Tahun ini
		$data['tahunini'] = $this->PengunjungModel->like('pengunjung_tgl', $thn)->countAllResults();