app/Controllers/Home.php

		$data['jml_video_kegiatan'] = $this->videoKegiatanModel->countAll();

		//konten
		$data['berita_foto'] = $this->beritaFotoModel
			->orderby('berita_foto_id', 'desc')
			->limit(4)->findAll();
		$data['video_kegiatan'] = $this->videoKegiatanModel
			->orderby('video_kegiatan_id', 'desc')
			->limit(3)->findAll();
		$data['penghargaan'] = $this->penghargaanModel
			->join('kategori', 'kategori.kategori_id = penghargaan.kategori_id')
			->orderby('penghargaan.penghargaan_id', 'desc')
			->limit(6)->findAll();
		$data['galeri_kegiatan'] = $this->galeriKegiatanModel
			->orderby('galeri_kegiatan_id', 'desc')
			->limit(4)->findAll();
---
SELECT *
FROM `berita_foto`
WHERE `berita_foto`.`deleted_at` IS NULL
ORDER BY `berita_foto_id` DESC
SELECT *
FROM `video_kegiatan`
WHERE `video_kegiatan`.`deleted_at` IS NULL
ORDER BY `video_kegiatan_id` DESC
SELECT *
FROM `penghargaan`
JOIN `kategori` ON `kategori`.`kategori_id` = `penghargaan`.`kategori_id`
WHERE `penghargaan`.`deleted_at` IS NULL
ORDER BY `penghargaan`.`penghargaan_id` DESC
SELECT *
FROM `galeri_kegiatan`
WHERE `galeri_kegiatan`.`deleted_at` IS NULL
ORDER BY `galeri_kegiatan_id` DESC

		$blan = date("Y-m");
		$thn = date("Y");
		//Hari ini
		$data['hariini'] = $this->PengunjungModel->where('pengunjung_tgl', $tgl)->countAllResults();
		//Bulan ini
		$data['bulanini'] = $this->PengunjungModel->like('pengunjung_tgl', $blan)->countAllResults();
		//Tahun ini
		$data['tahunini'] = $this->PengunjungModel->like('pengunjung_tgl', $thn)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pengunjung`
WHERE `pengunjung_tgl` LIKE '%2023-08%' ESCAPE '!'
AND `pengunjung`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `pengunjung`
WHERE `pengunjung_tgl` LIKE '%2023%' ESCAPE '!'
AND `pengunjung`.`deleted_at` IS NULL

	public function cari()
	{
		$data['title'] = '| Berita';
		$data['menu'] = 'kedua';
		$data['pengaturan'] = $this->pengaturanModel
			->first();

		//Menu
		$data['profil'] = $this->profilModel
			->orderby('profil_id', 'asc')
			->findAll();
		$data['sekretariat'] = $this->sekretariatModel
			->orderby('sekretariat_id', 'asc')
			->findAll();
		$data['berita'] = $this->beritaModel
			->orderby('berita_id', 'asc')
			->findAll();
		$data['kategori'] = $this->kategoriModel
			->orderby('kategori_id', 'asc')
			->findAll();
		$data['download'] = $this->downloadModel
			->orderby('download_id', 'asc')
			->findAll();

		//side
		$data['berita_baru'] = $this->beritadetailModel
			->join('berita', 'berita.berita_id = berita_detail.berita_id')
			->orderby('berita_detail.berita_detail_id', 'desc')
			->limit(5)->findAll();
		$data['agenda_baru'] = $this->agendaModel
			->orderby('agenda_id', 'desc')
			->limit(5)->findAll();

		$data['berita_populer'] = $this->beritadetailModel
			->join('berita', 'berita.berita_id = berita_detail.berita_id')
			->orderby('berita_detail.berita_detail_dibaca', 'desc')
			->limit(5)->findAll();
---
SELECT *
FROM `pengaturan`
WHERE `pengaturan`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `profil`
WHERE `profil`.`deleted_at` IS NULL
ORDER BY `profil_id` ASC
SELECT *
FROM `sekretariat`
WHERE `sekretariat`.`deleted_at` IS NULL
ORDER BY `sekretariat_id` ASC
SELECT *
FROM `berita`
WHERE `berita`.`deleted_at` IS NULL
ORDER BY `berita_id` ASC
SELECT *
FROM `kategori`
WHERE `kategori`.`deleted_at` IS NULL
ORDER BY `kategori_id` ASC
SELECT *
FROM `download`
WHERE `download`.`deleted_at` IS NULL
ORDER BY `download_id` ASC
SELECT *
FROM `berita_detail`
JOIN `berita` ON `berita`.`berita_id` = `berita_detail`.`berita_id`
WHERE `berita_detail`.`deleted_at` IS NULL
ORDER BY `berita_detail`.`berita_detail_id` DESC
SELECT *
FROM `agenda`
WHERE `agenda`.`deleted_at` IS NULL
ORDER BY `agenda_id` DESC
SELECT *
FROM `berita_detail`
JOIN `berita` ON `berita`.`berita_id` = `berita_detail`.`berita_id`
WHERE `berita_detail`.`deleted_at` IS NULL
ORDER BY `berita_detail`.`berita_detail_dibaca` DESC