app/Controllers/Penghargaan.php

SELECT *
FROM `pengaturan`
WHERE `pengaturan`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `profil`
WHERE `profil`.`deleted_at` IS NULL
ORDER BY `profil_id` ASC
SELECT *
FROM `sekretariat`
WHERE `sekretariat`.`deleted_at` IS NULL
ORDER BY `sekretariat_id` ASC
SELECT *
FROM `berita`
WHERE `berita`.`deleted_at` IS NULL
ORDER BY `berita_id` ASC
SELECT *
FROM `kategori`
WHERE `kategori`.`deleted_at` IS NULL
ORDER BY `kategori_id` ASC
SELECT *
FROM `download`
WHERE `download`.`deleted_at` IS NULL
ORDER BY `download_id` ASC
---
    public function index()
    {
        $data['title'] = '| Penghargaan';
        $data['menu'] = 'kedua';
        $data['pengaturan'] = $this->pengaturanModel
            ->first();

        //Menu
        $data['profil'] = $this->profilModel
            ->orderby('profil_id', 'asc')
            ->findAll();
        $data['sekretariat'] = $this->sekretariatModel
            ->orderby('sekretariat_id', 'asc')
            ->findAll();
        $data['berita'] = $this->beritaModel
            ->orderby('berita_id', 'asc')
            ->findAll();
        $data['kategori'] = $this->kategoriModel
            ->orderby('kategori_id', 'asc')
            ->findAll();
        $data['download_menu'] = $this->downloadModel
            ->orderby('download_id', 'asc')
            ->findAll();

SELECT *
FROM `berita_detail`
JOIN `berita` ON `berita`.`berita_id` = `berita_detail`.`berita_id`
WHERE `berita_detail`.`deleted_at` IS NULL
ORDER BY `berita_detail`.`berita_detail_id` DESC
SELECT *
FROM `agenda`
WHERE `agenda`.`deleted_at` IS NULL
ORDER BY `agenda_id` DESC
---
		$data['jml_video_kegiatan'] = $this->videoKegiatanModel->countAll();
        $data['jml_pidato_pantun'] = $this->pidatoPantunModel->countAll();
		$data['jml_galeri_kegiatan'] = $this->galeriKegiatanModel->countAll();
        $data['berita_baru'] = $this->beritadetailModel
            ->join('berita', 'berita.berita_id = berita_detail.berita_id')
            ->orderby('berita_detail.berita_detail_id', 'desc')
            ->limit(5)->findAll();
        $data['agenda_baru'] = $this->agendaModel
            ->orderby('agenda_id', 'desc')
            ->limit(5)->findAll();

SELECT *
FROM `pengaturan`
WHERE `pengaturan`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `profil`
WHERE `profil`.`deleted_at` IS NULL
ORDER BY `profil_id` ASC
SELECT *
FROM `sekretariat`
WHERE `sekretariat`.`deleted_at` IS NULL
ORDER BY `sekretariat_id` ASC
SELECT *
FROM `berita`
WHERE `berita`.`deleted_at` IS NULL
ORDER BY `berita_id` ASC
SELECT *
FROM `kategori`
WHERE `kategori`.`deleted_at` IS NULL
ORDER BY `kategori_id` ASC
SELECT *
FROM `download`
WHERE `download`.`deleted_at` IS NULL
ORDER BY `download_id` ASC
SELECT COUNT(*) AS `numrows` FROM `berita_detail`
SELECT COUNT(*) AS `numrows` FROM `galeri_kegiatan_foto`
SELECT COUNT(*) AS `numrows` FROM `berita_foto`
SELECT COUNT(*) AS `numrows` FROM `video_kegiatan`
SELECT COUNT(*) AS `numrows` FROM `pidato_pantun`
SELECT COUNT(*) AS `numrows` FROM `galeri_kegiatan`
SELECT *
FROM `berita_detail`
JOIN `berita` ON `berita`.`berita_id` = `berita_detail`.`berita_id`
WHERE `berita_detail`.`deleted_at` IS NULL
ORDER BY `berita_detail`.`berita_detail_id` DESC
SELECT *
FROM `agenda`
WHERE `agenda`.`deleted_at` IS NULL
ORDER BY `agenda_id` DESC
SELECT *
FROM `download_detail`
JOIN `download` ON `download`.`download_id` = `download_detail`.`download_id`
WHERE `download_detail`.`deleted_at` IS NULL
ORDER BY `download_detail`.`download_detail_id` DESC
SELECT *
FROM `berita_detail`
JOIN `berita` ON `berita`.`berita_id` = `berita_detail`.`berita_id`
WHERE `berita_detail`.`deleted_at` IS NULL
ORDER BY `berita_detail`.`berita_detail_dibaca` DESC
SELECT *
FROM `penghargaan`
JOIN `kategori` ON `kategori`.`kategori_id` = `penghargaan`.`kategori_id`
WHERE `penghargaan`.`penghargaan_slug` = 'pemkab-bengkalis-menerima-penghargaan-terbaik-sebagai-pemerintah-daerah-dengan-pemenuhan-syarat-penyaluran-dana-desa-tergesit-tahun-anggaran-2022'
AND `penghargaan`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `penghargaan`
JOIN `kategori` ON `kategori`.`kategori_id` = `penghargaan`.`kategori_id`
WHERE `kategori`.`kategori_slug` = 'agama'
AND `penghargaan`.`deleted_at` IS NULL
ORDER BY rand()
---
    public function detail($slugKategori, $slugKonten)
    {
        $data['title'] = '| Detail Penghargaan';
        $data['menu'] = 'kedua';
        $data['pengaturan'] = $this->pengaturanModel
            ->first();

        //Menu
        $data['profil'] = $this->profilModel
            ->orderby('profil_id', 'asc')
            ->findAll();
        $data['sekretariat'] = $this->sekretariatModel
            ->orderby('sekretariat_id', 'asc')
            ->findAll();
        $data['berita'] = $this->beritaModel
            ->orderby('berita_id', 'asc')
            ->findAll();
        $data['kategori'] = $this->kategoriModel
            ->orderby('kategori_id', 'asc')
            ->findAll();
        $data['download_menu'] = $this->downloadModel
            ->orderby('download_id', 'asc')
            ->findAll();

        //side
        $data['jml_berita'] = $this->beritadetailModel->countAll();
		$data['jml_galeri_foto'] = $this->galeriKegiatanFotoModel->countAll();
		$data['jml_berita_foto'] = $this->beritaFotoModel->countAll();
		$data['jml_video_kegiatan'] = $this->videoKegiatanModel->countAll();
        $data['jml_pidato_pantun'] = $this->pidatoPantunModel->countAll();
		$data['jml_galeri_kegiatan'] = $this->galeriKegiatanModel->countAll();
        $data['berita_baru'] = $this->beritadetailModel
            ->join('berita', 'berita.berita_id = berita_detail.berita_id')
            ->orderby('berita_detail.berita_detail_id', 'desc')
            ->limit(5)->findAll();
        $data['agenda_baru'] = $this->agendaModel
            ->orderby('agenda_id', 'desc')
            ->limit(5)->findAll();
        $data['download'] = $this->downloadDetailModel
            ->join('download', 'download.download_id = download_detail.download_id')
            ->orderby('download_detail.download_detail_id', 'desc')
            ->limit(5)->findAll();

        $data['berita_populer'] = $this->beritadetailModel
            ->join('berita', 'berita.berita_id = berita_detail.berita_id')
            ->orderby('berita_detail.berita_detail_dibaca', 'desc')
            ->limit(5)->findAll();

        $data['konten'] = $this->penghargaanModel
            ->join('kategori', 'kategori.kategori_id = penghargaan.kategori_id')
            ->where('penghargaan.penghargaan_slug', $slugKonten)
            ->first();
        $data['lainya'] = $this->penghargaanModel
            ->join('kategori', 'kategori.kategori_id = penghargaan.kategori_id')
            ->where('kategori.kategori_slug', $slugKategori)
            ->orderby('rand()')
            ->limit(6)->findAll();