app/Controllers/Penghargaan.php

SELECT *
FROM `berita_detail`
JOIN `berita` ON `berita`.`berita_id` = `berita_detail`.`berita_id`
WHERE `berita_detail`.`deleted_at` IS NULL
ORDER BY `berita_detail`.`berita_detail_dibaca` DESC
SELECT *
FROM `penghargaan`
JOIN `kategori` ON `kategori`.`kategori_id` = `penghargaan`.`kategori_id`
WHERE `penghargaan`.`deleted_at` IS NULL
ORDER BY `penghargaan`.`penghargaan_id` DESC
 LIMIT 9
SELECT COUNT(*) AS `numrows`
FROM `penghargaan`
JOIN `kategori` ON `kategori`.`kategori_id` = `penghargaan`.`kategori_id`
WHERE `penghargaan`.`deleted_at` IS NULL
---
            ->orderby('agenda_id', 'desc')
            ->limit(5)->findAll();

        $data['berita_populer'] = $this->beritadetailModel
            ->join('berita', 'berita.berita_id = berita_detail.berita_id')
            ->orderby('berita_detail.berita_detail_dibaca', 'desc')
            ->limit(5)->findAll();

        //Content
        $data['konten'] = $this->penghargaanModel
            ->join('kategori', 'kategori.kategori_id = penghargaan.kategori_id')
            ->orderby('penghargaan.penghargaan_id', 'desc')
            ->paginate(9, 'hal');