app/Controllers/Sekretariat.php

    public function index($slug)
    {
        $data['title'] = '| Profil';
        $data['menu'] = 'kedua';
        $data['pengaturan'] = $this->pengaturanModel
            ->first();

        //Menu
        $data['profil'] = $this->profilModel
            ->orderby('profil_id', 'asc')
            ->findAll();
        $data['sekretariat'] = $this->sekretariatModel
            ->orderby('sekretariat_id', 'asc')
            ->findAll();
        $data['berita'] = $this->beritaModel
            ->orderby('berita_id', 'asc')
            ->findAll();
        $data['kategori'] = $this->kategoriModel
            ->orderby('kategori_id', 'asc')
            ->findAll();
        $data['download'] = $this->downloadModel
            ->orderby('download_id', 'asc')
            ->findAll();

        //side
        $data['berita_baru'] = $this->beritadetailModel
            ->join('berita', 'berita.berita_id = berita_detail.berita_id')
            ->orderby('berita_detail.berita_detail_id', 'desc')
            ->limit(5)->findAll();
        $data['agenda_baru'] = $this->agendaModel
            ->orderby('agenda_id', 'desc')
            ->limit(5)->findAll();

        $data['berita_populer'] = $this->beritadetailModel
            ->join('berita', 'berita.berita_id = berita_detail.berita_id')
            ->orderby('berita_detail.berita_detail_dibaca', 'desc')
            ->limit(5)->findAll();

        //Konten
        $data['konten'] = $this->sekretariatModel
            ->where('sekretariat_slug', $slug)
            ->first();
---
SELECT *
FROM `pengaturan`
WHERE `pengaturan`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `profil`
WHERE `profil`.`deleted_at` IS NULL
ORDER BY `profil_id` ASC
SELECT *
FROM `sekretariat`
WHERE `sekretariat`.`deleted_at` IS NULL
ORDER BY `sekretariat_id` ASC
SELECT *
FROM `berita`
WHERE `berita`.`deleted_at` IS NULL
ORDER BY `berita_id` ASC
SELECT *
FROM `kategori`
WHERE `kategori`.`deleted_at` IS NULL
ORDER BY `kategori_id` ASC
SELECT *
FROM `download`
WHERE `download`.`deleted_at` IS NULL
ORDER BY `download_id` ASC
SELECT *
FROM `berita_detail`
JOIN `berita` ON `berita`.`berita_id` = `berita_detail`.`berita_id`
WHERE `berita_detail`.`deleted_at` IS NULL
ORDER BY `berita_detail`.`berita_detail_id` DESC
SELECT *
FROM `agenda`
WHERE `agenda`.`deleted_at` IS NULL
ORDER BY `agenda_id` DESC
SELECT *
FROM `berita_detail`
JOIN `berita` ON `berita`.`berita_id` = `berita_detail`.`berita_id`
WHERE `berita_detail`.`deleted_at` IS NULL
ORDER BY `berita_detail`.`berita_detail_dibaca` DESC
SELECT *
FROM `sekretariat`
WHERE `sekretariat_slug` = 'bagian-hukum'
AND `sekretariat`.`deleted_at` IS NULL
 LIMIT 1