app/Controllers/Statstik_pantun_pidato.php

            ->orderby('agenda_id', 'desc')
            ->limit(5)->findAll();

        $data['berita_populer'] = $this->beritadetailModel
            ->join('berita', 'berita.berita_id = berita_detail.berita_id')
            ->orderby('berita_detail.berita_detail_dibaca', 'desc')
            ->limit(5)->findAll();
---
SELECT *
FROM `berita_detail`
JOIN `berita` ON `berita`.`berita_id` = `berita_detail`.`berita_id`
WHERE `berita_detail`.`deleted_at` IS NULL
ORDER BY `berita_detail`.`berita_detail_dibaca` DESC

        // $data['slug'] = $this->kategoriModel
        //     ->where('kategori_slug', $slug)
        //     ->first();
        $data['konten'] = $this->pidatoDetailModel
            ->join('kategori', 'kategori.kategori_id = pidato_detail.kategori_id')
            ->orderby('pidato_detail.pidato_detail_id', 'desc')
            ->paginate(9, 'hal');
---
SELECT *
FROM `pidato_detail`
JOIN `kategori` ON `kategori`.`kategori_id` = `pidato_detail`.`kategori_id`
WHERE `pidato_detail`.`deleted_at` IS NULL
ORDER BY `pidato_detail`.`pidato_detail_id` DESC
 LIMIT 9
SELECT COUNT(*) AS `numrows`
FROM `pidato_detail`
JOIN `kategori` ON `kategori`.`kategori_id` = `pidato_detail`.`kategori_id`
WHERE `pidato_detail`.`deleted_at` IS NULL

        $data['nomor'] = nomor($this->request->getVar('page_hal'), 9);
        // SELECT k.kategori_judul, COUNT(pp.pidato_pantun_id) as jml
        // FROM kategori k,pidato_pantun pp WHERE k.kategori_id = pp.kategori_id GROUP BY pp.kategori_id;
        $judulData = $this->pidatoPantunModel
            ->select('kategori.kategori_judul')
            ->join('kategori', 'kategori.kategori_id = pidato_pantun.kategori_id')
            ->groupby('pidato_pantun.kategori_id')
            ->findAll();
        $jmlData = $this->pidatoPantunModel
            ->select('COUNT(pidato_pantun.pidato_pantun_id) as jml')
            ->join('kategori', 'kategori.kategori_id = pidato_pantun.kategori_id')
            ->groupby('pidato_pantun.kategori_id')
            ->findAll();
---
SELECT `kategori`.`kategori_judul`
FROM `pidato_pantun`
JOIN `kategori` ON `kategori`.`kategori_id` = `pidato_pantun`.`kategori_id`
WHERE `pidato_pantun`.`deleted_at` IS NULL
GROUP BY `pidato_pantun`.`kategori_id`
SELECT COUNT(pidato_pantun.pidato_pantun_id) as jml
FROM `pidato_pantun`
JOIN `kategori` ON `kategori`.`kategori_id` = `pidato_pantun`.`kategori_id`
WHERE `pidato_pantun`.`deleted_at` IS NULL
GROUP BY `pidato_pantun`.`kategori_id`